--- Курс по SQL ---

-- 1. Создание таблицы
CREATE TABLE book(book_id INT PRIMARY KEY AUTO_INCREMENT, title VARCHAR(50), author VARCHAR(30), price DECIMAL(8, 2), amount INT);

-- 2. Вставка записи в таблицу
insert into book(title, author, price, amount) values('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);
/*
Query result:
+---------+--------------------+---------------+--------+--------+
| book_id | title              | author        | price  | amount |
+---------+--------------------+---------------+--------+--------+
| 1       | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3      |
+---------+--------------------+---------------+--------+--------+
Affected rows: 1
*/

-- 3. Выборка всех данных из таблицы
select * from book;
/*
Query result:
+---------+-----------------------+------------------+--------+--------+
| book_id | title                 | author           | price  | amount |
+---------+-----------------------+------------------+--------+--------+
| 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
| 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
| 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
+---------+-----------------------+------------------+--------+--------+
Affected rows: 5
*/

-- 4. Выборка отдельных столбцов
select author, title, price from book;
/*
Query result:
+------------------+-----------------------+--------+
| author           | title                 | price  |
+------------------+-----------------------+--------+
| Булгаков М.А.    | Мастер и Маргарита    | 670.99 |
| Булгаков М.А.    | Белая гвардия         | 540.50 |
| Достоевский Ф.М. | Идиот                 | 460.00 |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01 |
| Есенин С.А.      | Стихотворения и поэмы | 650.00 |
+------------------+-----------------------+--------+
Affected rows: 5
*/

-- 5. Выборка отдельных столбцов и присвоение им новых имён
select title as Название, author as Автор from book;
/*
Query result:
+-----------------------+------------------+
| Название              | Автор            |
+-----------------------+------------------+
| Мастер и Маргарита    | Булгаков М.А.    |
| Белая гвардия         | Булгаков М.А.    |
| Идиот                 | Достоевский Ф.М. |
| Братья Карамазовы     | Достоевский Ф.М. |
| Стихотворения и поэмы | Есенин С.А.      |
+-----------------------+------------------+
Affected rows: 5
*/

-- 6. Выборка данных с созданием вычисляемого столбца
select title, amount, amount * 1.65 as pack from book;
/*
Query result:
+-----------------------+--------+-------+
| title                 | amount | pack  |
+-----------------------+--------+-------+
| Мастер и Маргарита    | 3      | 4.95  |
| Белая гвардия         | 5      | 8.25  |
| Идиот                 | 10     | 16.50 |
| Братья Карамазовы     | 2      | 3.30  |
| Стихотворения и поэмы | 15     | 24.75 |
+-----------------------+--------+-------+
Affected rows: 5
*/

-- 7. Выборка данных, вычисляемые столбцы, математические функции
/*
	Функция 	Описание 													Пример
	ceiling(x)	возвращает наименьшее целое число, большее или равное x 	ceiling(4.2) = 5	ceiling(-5.8) = -5
	round(x, k) округляет значение x до k знаков после запятой,
				если k не указано – x округляется до целого 				round(4.361) = 4	round(5.86592,1) = 5.9
	floor(x) 	возвращает наибольшее целое число, меньшее или равное x 	floor(4.2) = 4		floor(-5.8) = -6
	power(x, y) возведение x в степень y 									power(3,4) = 81.0
	sqrt(x) 	квадратный корень из x 										sqrt(4) = 2.0		sqrt(2) = 1.41
	degrees(x) 	конвертирует значение x из радиан в градусы 				degrees(3) = 171.8
	radians(x) 	конвертирует значение x из градусов в радианы 				radians(180) = 3.14
	abs(x) 		модуль числа x 												abs(-1) = 1			abs(1) = 1
	pi 			pi = 3.1415926 	 
*/

select title, author, amount, round(price - price * 0.3, 2) as new_price from book;
/*
Query result:
+-----------------------+------------------+--------+-----------+
| title                 | author           | amount | new_price |
+-----------------------+------------------+--------+-----------+
| Мастер и Маргарита    | Булгаков М.А.    | 3      | 469.69    |
| Белая гвардия         | Булгаков М.А.    | 5      | 378.35    |
| Идиот                 | Достоевский Ф.М. | 10     | 322.00    |
| Братья Карамазовы     | Достоевский Ф.М. | 2      | 559.31    |
| Стихотворения и поэмы | Есенин С.А.      | 15     | 455.00    |
+-----------------------+------------------+--------+-----------+
Affected rows: 5
*/

-- 8. Выборка данных, вычисляемые столбцы, логические функции
-- SELECT title, amount, price, round(IF(amount < 4, price * 0.5, IF(amount < 11, price * 0.7, price * 0.9)),2) AS sale FROM book;
select author, title, round(if (author = 'Булгаков М.А.', price * 1.1, if (author = 'Есенин С.А.', price * 1.05, price)), 2) as new_price from book;
/*
Query result:
+------------------+-----------------------+-----------+
| author           | title                 | new_price |
+------------------+-----------------------+-----------+
| Булгаков М.А.    | Мастер и Маргарита    | 738.09    |
| Булгаков М.А.    | Белая гвардия         | 594.55    |
| Достоевский Ф.М. | Идиот                 | 460.00    |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
| Есенин С.А.      | Стихотворения и поэмы | 682.50    |
+------------------+-----------------------+-----------+
Affected rows: 5
*/

-- 9. Выборка данных по условию
select author, title, price from book where amount < 10;
/*
Query result:
+------------------+--------------------+--------+
| author           | title              | price  |
+------------------+--------------------+--------+
| Булгаков М.А.    | Мастер и Маргарита | 670.99 |
| Булгаков М.А.    | Белая гвардия      | 540.50 |
| Достоевский Ф.М. | Братья Карамазовы  | 799.01 |
+------------------+--------------------+--------+
Affected rows: 3
*/

-- 10. Выборка данных, логические операции
select title, author, price, amount 
from book
where (price < 500 or price > 600) and price * amount >= 5000;
/*
Query result:
+-----------------------+-------------+--------+--------+
| title                 | author      | price  | amount |
+-----------------------+-------------+--------+--------+
| Стихотворения и поэмы | Есенин С.А. | 650.00 | 15     |
+-----------------------+-------------+--------+--------+
Affected rows: 1
*/

-- 11. Выборка данных, операторы BETWEEN, IN
select title, author
from book
where (price between 540.50 and 800) and amount in(2, 3, 5, 7);
/*
Query result:
+--------------------+------------------+
| title              | author           |
+--------------------+------------------+
| Мастер и Маргарита | Булгаков М.А.    |
| Белая гвардия      | Булгаков М.А.    |
| Братья Карамазовы  | Достоевский Ф.М. |
+--------------------+------------------+
Affected rows: 3
*/

-- 12. Выборка данных, оператор LIKE
select title, author
from book
where (title like '_% _% _%') and author like '%с%';
/*
Query result:
+-----------------------+-------------+
| title                 | author      |
+-----------------------+-------------+
| Стихотворения и поэмы | Есенин С.А. |
+-----------------------+-------------+
Affected rows: 1
*/

-- 13. Выборка данных с сортировкой
select author, title
from book
where amount between 2 and 14
order by author desc, title asc;
/*
Query result:
+------------------+--------------------+
| author           | title              |
+------------------+--------------------+
| Достоевский Ф.М. | Братья Карамазовы  |
| Достоевский Ф.М. | Идиот              |
| Булгаков М.А.    | Белая гвардия      |
| Булгаков М.А.    | Мастер и Маргарита |
+------------------+--------------------+
Affected rows: 4
*/

-- 14. Отбор уникальных элементов некоторого столбца
SELECT DISTINCT author FROM book;
/* 
Query result:
+------------------+
| author           |
+------------------+
| Булгаков М.А.    |
| Достоевский Ф.М. |
| Есенин С.А.      |
+------------------+
Affected rows: 3
*/

-- 15. Группировка данных при выборке
select amount from book group by amount;
/*
Query result:
+--------+
| amount |
+--------+
| 3      |
| 5      |
| 10     |
| 15     |
+--------+
Affected rows: 4
*/ 

---
