--- Курс по SQL ---

-- 1. Создание таблицы
CREATE TABLE book(book_id INT PRIMARY KEY AUTO_INCREMENT, title VARCHAR(50), author VARCHAR(30), price DECIMAL(8, 2), amount INT);

-- 2. Вставка записи в таблицу
insert into book(title, author, price, amount) values('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);
/*
Query result:
+---------+--------------------+---------------+--------+--------+
| book_id | title              | author        | price  | amount |
+---------+--------------------+---------------+--------+--------+
| 1       | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3      |
+---------+--------------------+---------------+--------+--------+
Affected rows: 1
*/

-- 3. Выборка всех данных из таблицы
select * from book;
/*
Query result:
+---------+-----------------------+------------------+--------+--------+
| book_id | title                 | author           | price  | amount |
+---------+-----------------------+------------------+--------+--------+
| 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
| 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
| 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
+---------+-----------------------+------------------+--------+--------+
Affected rows: 5
*/

-- 4. Выборка отдельных столбцов
select author, title, price from book;
/*
Query result:
+------------------+-----------------------+--------+
| author           | title                 | price  |
+------------------+-----------------------+--------+
| Булгаков М.А.    | Мастер и Маргарита    | 670.99 |
| Булгаков М.А.    | Белая гвардия         | 540.50 |
| Достоевский Ф.М. | Идиот                 | 460.00 |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01 |
| Есенин С.А.      | Стихотворения и поэмы | 650.00 |
+------------------+-----------------------+--------+
Affected rows: 5
*/

-- 5. Выборка отдельных столбцов и присвоение им новых имён
select title as 'Название', author as 'Автор' from book;
/*
Query result:
+-----------------------+------------------+
| Название              | Автор            |
+-----------------------+------------------+
| Мастер и Маргарита    | Булгаков М.А.    |
| Белая гвардия         | Булгаков М.А.    |
| Идиот                 | Достоевский Ф.М. |
| Братья Карамазовы     | Достоевский Ф.М. |
| Стихотворения и поэмы | Есенин С.А.      |
+-----------------------+------------------+
Affected rows: 5
*/

-- 6. Выборка данных с созданием вычисляемого столбца
select title, amount, amount * 1.65 as pack from book;
/*
Query result:
+-----------------------+--------+-------+
| title                 | amount | pack  |
+-----------------------+--------+-------+
| Мастер и Маргарита    | 3      | 4.95  |
| Белая гвардия         | 5      | 8.25  |
| Идиот                 | 10     | 16.50 |
| Братья Карамазовы     | 2      | 3.30  |
| Стихотворения и поэмы | 15     | 24.75 |
+-----------------------+--------+-------+
Affected rows: 5
*/

-- 7. Выборка данных, вычисляемые столбцы, математические функции
/*
	Функция 	Описание 													Пример
	ceiling(x)	возвращает наименьшее целое число, большее или равное x 	ceiling(4.2) = 5	ceiling(-5.8) = -5
	round(x, k) округляет значение x до k знаков после запятой,
				если k не указано – x округляется до целого 				round(4.361) = 4	round(5.86592,1) = 5.9
	floor(x) 	возвращает наибольшее целое число, меньшее или равное x 	floor(4.2) = 4		floor(-5.8) = -6
	power(x, y) возведение x в степень y 									power(3,4) = 81.0
	sqrt(x) 	квадратный корень из x 										sqrt(4) = 2.0		sqrt(2) = 1.41
	degrees(x) 	конвертирует значение x из радиан в градусы 				degrees(3) = 171.8
	radians(x) 	конвертирует значение x из градусов в радианы 				radians(180) = 3.14
	abs(x) 		модуль числа x 												abs(-1) = 1			abs(1) = 1
	pi 			pi = 3.1415926 	 
*/

select title, author, amount, round(price - price * 0.3, 2) as new_price from book;
/*
Query result:
+-----------------------+------------------+--------+-----------+
| title                 | author           | amount | new_price |
+-----------------------+------------------+--------+-----------+
| Мастер и Маргарита    | Булгаков М.А.    | 3      | 469.69    |
| Белая гвардия         | Булгаков М.А.    | 5      | 378.35    |
| Идиот                 | Достоевский Ф.М. | 10     | 322.00    |
| Братья Карамазовы     | Достоевский Ф.М. | 2      | 559.31    |
| Стихотворения и поэмы | Есенин С.А.      | 15     | 455.00    |
+-----------------------+------------------+--------+-----------+
Affected rows: 5
*/

-- 8. Выборка данных, вычисляемые столбцы, логические функции
-- SELECT title, amount, price, round(IF(amount < 4, price * 0.5, IF(amount < 11, price * 0.7, price * 0.9)),2) AS sale FROM book;
select author, title, round(if (author = 'Булгаков М.А.', price * 1.1, if (author = 'Есенин С.А.', price * 1.05, price)), 2) as new_price from book;
/*
Query result:
+------------------+-----------------------+-----------+
| author           | title                 | new_price |
+------------------+-----------------------+-----------+
| Булгаков М.А.    | Мастер и Маргарита    | 738.09    |
| Булгаков М.А.    | Белая гвардия         | 594.55    |
| Достоевский Ф.М. | Идиот                 | 460.00    |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
| Есенин С.А.      | Стихотворения и поэмы | 682.50    |
+------------------+-----------------------+-----------+
Affected rows: 5
*/

-- 9. Выборка данных по условию
select author, title, price 
from book 
where amount < 10;
/*
Query result:
+------------------+--------------------+--------+
| author           | title              | price  |
+------------------+--------------------+--------+
| Булгаков М.А.    | Мастер и Маргарита | 670.99 |
| Булгаков М.А.    | Белая гвардия      | 540.50 |
| Достоевский Ф.М. | Братья Карамазовы  | 799.01 |
+------------------+--------------------+--------+
Affected rows: 3
*/

-- 10. Выборка данных, логические операции
select title, author, price, amount 
from book
where (price < 500 or price > 600) and price * amount >= 5000;
/*
Query result:
+-----------------------+-------------+--------+--------+
| title                 | author      | price  | amount |
+-----------------------+-------------+--------+--------+
| Стихотворения и поэмы | Есенин С.А. | 650.00 | 15     |
+-----------------------+-------------+--------+--------+
Affected rows: 1
*/

-- 11. Выборка данных, операторы BETWEEN, IN
select title, author
from book
where (price between 540.50 and 800) and amount in(2, 3, 5, 7);
/*
Query result:
+--------------------+------------------+
| title              | author           |
+--------------------+------------------+
| Мастер и Маргарита | Булгаков М.А.    |
| Белая гвардия      | Булгаков М.А.    |
| Братья Карамазовы  | Достоевский Ф.М. |
+--------------------+------------------+
Affected rows: 3
*/

-- 12. Выборка данных, оператор LIKE
select title, author
from book
where (title like '_% _% _%') and author like '%с%';
/*
Query result:
+-----------------------+-------------+
| title                 | author      |
+-----------------------+-------------+
| Стихотворения и поэмы | Есенин С.А. |
+-----------------------+-------------+
Affected rows: 1
*/

-- 13. Выборка данных с сортировкой
select author, title
from book
where amount between 2 and 14
order by author desc, title asc;
/*
Query result:
+------------------+--------------------+
| author           | title              |
+------------------+--------------------+
| Достоевский Ф.М. | Братья Карамазовы  |
| Достоевский Ф.М. | Идиот              |
| Булгаков М.А.    | Белая гвардия      |
| Булгаков М.А.    | Мастер и Маргарита |
+------------------+--------------------+
Affected rows: 4
*/

-- 14. Отбор уникальных элементов некоторого столбца
SELECT DISTINCT author 
FROM book;
/* 
Query result:
+------------------+
| author           |
+------------------+
| Булгаков М.А.    |
| Достоевский Ф.М. |
| Есенин С.А.      |
+------------------+
Affected rows: 3
*/

-- 15. Группировка данных при выборке
select amount 
from book 
group by amount;
/*
Query result:
+--------+
| amount |
+--------+
| 3      |
| 5      |
| 10     |
| 15     |
+--------+
Affected rows: 4
*/ 

-- 16. Выборка данных, групповые функции SUM и COUNT
-- SELECT author, SUM(amount) FROM book GROUP BY author;
-- SELECT author, COUNT(author), COUNT(amount), COUNT(*) FROM book GROUP BY author;

-- COUNT(*) — подсчитывает все записи, относящиеся к группе, в том числе и со значением NULL;
-- COUNT(имя_столбца) — возвращает количество записей конкретного столбца (только NOT NULL), относящихся к группе.

-- ВАЖНО	После оператора GROUP BY должны перечисляться ВСЕ неагрегированные столбцы, 
-- 			т.е. столбцы, к которым не применены групповые функции), указанные после SELECT.

select author as 'Автор', count(title) as 'Различных_книг', sum(amount) as 'Количество_экземпляров'
from book
group by author;
/*
Query result:
+------------------+----------------+------------------------+
| Автор            | Различных_книг | Количество_экземпляров |
+------------------+----------------+------------------------+
| Булгаков М.А.    | 2              | 8                      |
| Достоевский Ф.М. | 3              | 23                     |
| Есенин С.А.      | 1              | 15                     |
+------------------+----------------+------------------------+
Affected rows: 3
*/

-- 17. Выборка данных, групповые функции MIN, MAX и AVG
select author, min(price) as 'Минимальная_цена', max(price) as 'Максимальная_цена', avg(price) as 'Средняя_цена'
from book
group by author;
/*
Query result:
+------------------+------------------+-------------------+--------------+
| author           | Минимальная_цена | Максимальная_цена | Средняя_цена |
+------------------+------------------+-------------------+--------------+
| Булгаков М.А.    | 540.50           | 670.99            | 605.745000   |
| Достоевский Ф.М. | 460.00           | 799.01            | 579.836667   |
| Есенин С.А.      | 650.00           | 650.00            | 650.000000   |
+------------------+------------------+-------------------+--------------+
Affected rows: 3
*/

-- 18. Выборка данных c вычислением, групповые функции
select author, 
sum(price * amount) as 'Стоимость', 
round((sum(price * amount) * 0.18) / 1.18, 2) as 'НДС',
round(sum(price * amount) / 1.18, 2) as 'Стоимость_без_НДС' 
from book
group by author;
/*
Query result:
+------------------+-----------+---------+-------------------+
| author           | Стоимость | НДС     | Стоимость_без_НДС |
+------------------+-----------+---------+-------------------+
| Булгаков М.А.    | 4715.47   | 719.31  | 3996.16           |
| Достоевский Ф.М. | 11802.03  | 1800.31 | 10001.72          |
| Есенин С.А.      | 9750.00   | 1487.29 | 8262.71           |
+------------------+-----------+---------+-------------------+
Affected rows: 3
*/

-- 19. Вычисления по таблице целиком
select min(price) as 'Минимальная_цена', max(price) as 'Максимальная_цена', round(avg(price), 2) as 'Средняя_цена'
from book;
/*
Query result:
+------------------+-------------------+--------------+
| Минимальная_цена | Максимальная_цена | Средняя_цена |
+------------------+-------------------+--------------+
| 460.00           | 799.01            | 600.17       |
+------------------+-------------------+--------------+
Affected rows: 1
*/

-- 20. Выборка данных по условию, групповые функции (HAVING)
-- Пояснение. Если в запросе с групповыми функциями отсутствует GROUP BY, то для отбора записей используется ключевое слово WHERE.
select 
round(avg(price), 2) as 'Средняя_цена', 
round(sum(price * amount), 2) as 'Стоимость'
from book
where (amount between 5 and 14);
/*
Query result:
+--------------+-----------+
| Средняя_цена | Стоимость |
+--------------+-----------+
| 493.67       | 12107.50  |
+--------------+-----------+
Affected rows: 1
*/

-- 21. Выборка данных по условию, групповые функции, WHERE и HAVING
select author, round(sum(price * amount), 2) as 'Стоимость'
from book
where title not in('Идиот', 'Белая гвардия')
group by author
having sum(price * amount) > 5000
order by 1 desc;
/*
Query result:
+------------------+-----------+
| author           | Стоимость |
+------------------+-----------+
| Есенин С.А.      | 9750.00   |
| Достоевский Ф.М. | 7202.03   |
+------------------+-----------+
Affected rows: 2
*/

-- 22. Вложенный запрос, возвращающий одно значение
select author, title, price
from book
where price <= (select round(avg(price), 2) from book)
order by price desc;
/*
Query result:
+------------------+---------------+--------+
| author           | title         | price  |
+------------------+---------------+--------+
| Булгаков М.А.    | Белая гвардия | 540.50 |
| Достоевский Ф.М. | Игрок         | 480.50 |
| Достоевский Ф.М. | Идиот         | 460.00 |
+------------------+---------------+--------+
Affected rows: 3
*/

-- 23. Использование вложенного запроса в выражении
/*
Вывести информацию (автора, название и цену) о тех книгах, 
цены которых превышают минимальную цену книги на складе 
не более чем на 150 рублей в отсортированном по возрастанию цены виде.
*/
select author, title, price 
from book
where price <= ((SELECT min(price) FROM book) + 150)
order by price asc;
/*
Query result:
+------------------+---------------+--------+
| author           | title         | price  |
+------------------+---------------+--------+
| Достоевский Ф.М. | Идиот         | 460.00 |
| Достоевский Ф.М. | Игрок         | 480.50 |
| Булгаков М.А.    | Белая гвардия | 540.50 |
+------------------+---------------+--------+
Affected rows: 3
*/

-- 24. Вложенный запрос, оператор IN
/*
Вывести информацию (автора, книгу и количество) о тех книгах, количество которых в таблице book не повторяется.
*/
select author, title, amount 
from book
where amount in(
	SELECT amount 
	FROM book 
	GROUP BY amount 
	HAVING count(amount) = 1);
/*
Query result:
+---------------+-----------------------+--------+
| author        | title                 | amount |
+---------------+-----------------------+--------+
| Булгаков М.А. | Белая гвардия         | 5      |
| Есенин С.А.   | Стихотворения и поэмы | 15     |
+---------------+-----------------------+--------+
Affected rows: 2
*/

-- 25. Вложенный запрос, операторы ANY и ALL
-- Вложенный запрос, возвращающий несколько значений одного столбца, 
-- можно использовать для отбора записей с помощью операторов ANY и ALL 
-- совместно с операциями отношения (=, <>, <=, >=, <, >).

-- Важно! Операторы ALL и ANY можно использовать только с вложенными запросами.

/*
Вывести информацию о книгах(автор, название, цена) только тех авторов, средняя цена книг которых выше, чем средняя цена книг на складе в целом.
*/
select author, title, price
from book
where author in (
select author
from book
group by author
having avg(price) > (select round(avg(price), 2) from book));
/*
Query result:
+---------------+-----------------------+--------+
| author        | title                 | price  |
+---------------+-----------------------+--------+
| Булгаков М.А. | Мастер и Маргарита    | 670.99 |
| Булгаков М.А. | Белая гвардия         | 540.50 |
| Есенин С.А.   | Стихотворения и поэмы | 650.00 |
+---------------+-----------------------+--------+
Affected rows: 3
*/

-- 26. Вложенный запрос после SELECT
/*
Посчитать сколько и каких книг нужно заказать поставщикам, чтобы на складе было одинаковое количество каждой книги, 
равное максимальному значению из всех количеств книг, хранящихся на складе. Столбцу с количеством заказываемых книг присвоить имя Заказ.
*/
select title, author, amount, ((select max(amount) from book) - amount) as 'Заказ'
from book
where amount <> (select max(amount) from book);
/*
Query result:
+--------------------+------------------+--------+-------+
| title              | author           | amount | Заказ |
+--------------------+------------------+--------+-------+
| Мастер и Маргарита | Булгаков М.А.    | 3      | 12    |
| Белая гвардия      | Булгаков М.А.    | 5      | 10    |
| Идиот              | Достоевский Ф.М. | 10     | 5     |
| Братья Карамазовы  | Достоевский Ф.М. | 3      | 12    |
| Игрок              | Достоевский Ф.М. | 10     | 5     |
+--------------------+------------------+--------+-------+
Affected rows: 5
*/

-- Модуль запросы корректировки данных
-- 27. Создание пустой таблицы
/*
Создать таблицу поставка (supply), которая имеет ту же структуру, что и таблица book.
*/
create table supply (
    supply_id INT PRIMARY KEY AUTO_INCREMENT,
    title varchar(50),
    author varchar(30),
    price decimal(8, 2),
    amount int);

/*
Affected rows: 0
*/

-- 28. Добавление записей в таблицу
insert into supply (title, author, price, amount) values ('Лирика', 'Пастернак Б.Л.', 518.99, 2);
insert into supply (title, author, price, amount) values ('Черный человек', 'Есенин С.А.', 570.20, 6);
insert into supply (title, author, price, amount) values ('Белая гвардия', 'Булгаков М.А.', 540.50, 7);
insert into supply (title, author, price, amount) values ('Идиот', 'Достоевский Ф.М.', 360.80, 3);

/*
Affected rows: 1
Affected rows: 1
Affected rows: 1
Affected rows: 1
Query result:
+-----------+----------------+------------------+--------+--------+
| supply_id | title          | author           | price  | amount |
+-----------+----------------+------------------+--------+--------+
| 1         | Лирика         | Пастернак Б.Л.   | 518.99 | 2      |
| 2         | Черный человек | Есенин С.А.      | 570.20 | 6      |
| 3         | Белая гвардия  | Булгаков М.А.    | 540.50 | 7      |
| 4         | Идиот          | Достоевский Ф.М. | 360.80 | 3      |
+-----------+----------------+------------------+--------+--------+
Affected rows: 4
*/

-- 29. Добавление записей из другой таблицы
/*
Добавить из таблицы supply в таблицу book, все книги, кроме книг, написанных Булгаковым и Достоевским.
*/
insert into book(title, author, price, amount) 
    select title, author, price, amount
    from supply
    where author not in ('Булгаков М.А.', 'Достоевский Ф.М.');
/*
Affected rows: 2

Query result:
+---------+-----------------------+------------------+--------+--------+
| book_id | title                 | author           | price  | amount |
+---------+-----------------------+------------------+--------+--------+
| 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
| 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
| 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
| 6       | Лирика                | Пастернак Б.Л.   | 518.99 | 2      |
| 7       | Черный человек        | Есенин С.А.      | 570.20 | 6      |
+---------+-----------------------+------------------+--------+--------+
Affected rows: 7
*/

-- 30. 
